# 5. 데이터 불러오기와 간단한 분석까지

In [161]:
# 필요한 모듈 불러오기
import numpy as np
import pandas as pd

## 파일 다루기  
csv, json

### CSV 파일 불러오기

In [14]:
# 판다스를 사용해서 CSV 파일 불러오기
# read_csv(파일의 경로)
# 상대경로/절대경로
# 현재 나의 위치: python-data-study
# 찾고자 하는 파일 : sample1.csv
# read_csv 는 csv 파일을 읽어서 데이터 프레임으로 반환
df = pd.read_csv('sample-20250916T010128Z-1-001\sample\sample1.csv')
print(df)
# 읽어온 데이터 속성 확인
# 행열 이름 확인
print(df.index)
df.columns
# 행 인덱스 : 자동으로 정수 인덱스가 설정됨
# 열 컬럼 : 자동으로 첫번째 행이 컬럼으로 설정됨
# 행 인덱스 바꾸기
# 학번을 인덱스로 설정
df.set_index('student_id')

   student_id  math  eng  kor
0         101    80   95   88
1         102    92   85   90
2         103    75   80   66
RangeIndex(start=0, stop=3, step=1)

            math  eng  kor
student_id
101           80   95   88
102           92   85   90
103           75   80   66

## csv 파일 불러오기2

In [21]:
# sample 폴더 아래 2번째 csv 파일 불러오기
# 판다스 사용
# 파일에 한글이포함되어 있으면, 한글을 지원하는 인코딩 설정
# 한글을 지원하는 인코딩 : utf-8, euc-kr
df = pd.read_csv('sample-20250916T010128Z-1-001\sample\sample2.csv',
                 encoding='euc-kr')
print(df)
# set_index 는 결과만 반환, 원본데이터 영향x
# 나중에 데이터를 쉽게 조회/수정/삭제 하기위해
# 상품명을 행 인덱스로 설정
df = df.set_index('상품명')
print(df.index)
print(df.columns)

   상품명       가격  재고
0  노트북  1200000   5
1  키보드    29000  20
2  마우스    19000  15
Index(['노트북', '키보드', '마우스'], dtype='object', name='상품명')
Index(['가격', '재고'], dtype='object')

In [24]:
# 다시 2번째 csv 파일 불러오기
df = pd.read_csv('sample-20250916T010128Z-1-001\sample\sample2.csv',
                 encoding='euc-kr')
df
# 상품명 컬럼을 유지하면서, 상품명을 행인덱스로 설정하기
df.index = df['상품명']
df

     상품명       가격  재고
상품명
노트북  노트북  1200000   5
키보드  키보드    29000  20
마우스  마우스    19000  15

In [39]:
df = pd.read_csv('quiz-20250916T010128Z-1-001\quiz\products.csv')
print(df)
print('\n')
df = df.set_index('상품명')
print(df)
print('\n')
print(df.index)
print('\n')
print('사과 가격:', df.loc['사과','가격'])
print('바나나 재고: ', df.loc['바나나','재고'])
df.loc['포도','가격'] = 4500
print('\n')
print(df)
df.loc['딸기','재고'] = 10
print('\n')
print(df)

   상품명    가격  재고
0   사과  3000  10
1  바나나  2000  20
2   포도  4000  15
3   딸기  5000   8


       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4000  15
딸기   5000   8


Index(['사과', '바나나', '포도', '딸기'], dtype='object', name='상품명')


사과 가격: 3000
바나나 재고:  20


       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4500  15
딸기   5000   8


       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4500  15
딸기   5000  10

In [62]:
df = pd.read_csv('quiz-20250916T010128Z-1-001\quiz\sales.csv',
                 encoding='euc-kr')
print(df)
print('\n')
df = df.set_index('month')
print(df)
print('\n')
print(df.index)
print('\n')
print(df['sales'])
print('\n')
print(df.loc['2월'])
print('\n')
print('이윤 합계 : ', df['profit'].sum())
print('이윤 평균 : ', df['profit'].mean())
print('\n')
df[df['profit'] > 300]

  month  sales  profit
0    1월   1000     200
1    2월   1500     300
2    3월   2000     400
3    4월   2500     500


       sales  profit
month
1월      1000     200
2월      1500     300
3월      2000     400
4월      2500     500


Index(['1월', '2월', '3월', '4월'], dtype='object', name='month')


month
1월    1000
2월    1500
3월    2000
4월    2500
Name: sales, dtype: int64


sales     1500
profit     300
Name: 2월, dtype: int64


이윤 합계 :  1400
이윤 평균 :  350.0

       sales  profit
month
3월      2000     400
4월      2500     500

In [87]:
df = pd.read_csv('quiz-20250916T010128Z-1-001\quiz\weather.csv',
                encoding='euc-kr')
print(df['spring'])
print('\n')
df.set_index('city')
print(df.iloc[0])
print('\n')
print('겨울평균기온: ', df['winter'].mean())
print('\n')
df[df['summer'] >= 28]

0    15
1    17
2    14
3    18
Name: spring, dtype: int64


city      서울
spring    15
summer    28
winter     2
Name: 0, dtype: object


겨울평균기온:  2.75

  city  spring  summer  winter
0   서울      15      28       2
1   부산      17      29       5
3   대구      18      30       1

## JSON 파일 불러오기1  
파이썬의 딕셔너리와 구조가 비슷  
json 파일을 파싱한다 => json 데이터를 파이썬에서 사용할 수 있는 형태로 변환한다  
- json 작성 방법 : key:value  
- object : { }  
- list : [ ]

In [94]:
import json
# 파이썬 방식으로 파일 열기
f = open('sample-20250916T010128Z-1-001/sample/sample3.json', 'r')
# json 모듈로 파일을 딕셔너리로 변환
dic = json.load(f)
dic

{'id': 101, 'name': 'alice', 'age': 30}

## JSON 파일 불러오기2

In [100]:
f = open('sample-20250916T010128Z-1-001/sample/sample4.json',
         'r', encoding='utf-8')
dic = json.load(f)
dic

{'name': '홍길동', 'age': 25, 'city': '서울'}

In [102]:
# 왜 파일의 내용을 딕셔너리로 변환해야 할까?
# f도 read readline 함수를 지원함
# read, readline 은 텍스트를 통으로 가져오기 때문에
# 내가 원하는 값만 추출하기 어려움

In [107]:
# 딕셔너리에서 키와 값 꺼내기
print(dic.items())
for tup in dic.items():
    print(tup)

dict_items([('name', '홍길동'), ('age', 25), ('city', '서울')])
('name', '홍길동')
('age', 25)
('city', '서울')

In [108]:
for key, value in dic.items():
    print(key, value)

name 홍길동
age 25
city 서울

## JSON 파일 불러오기 3

In [113]:
# json 파일 불러오기 1
f = open('sample-20250916T010128Z-1-001\sample\sample5.json',
         encoding='utf-8')
dic = json.load(f)
dic

[{'name': '홍길동', 'age': 25, 'city': '서울'},
 {'name': '김철수', 'age': 30, 'city': '부산'}]

In [115]:
# json 파일 불러오기 2
# 판다스를 사용해서 파일을 바로 dataframe으로 변환
# 단건 데이터는 데이터 프레임으로 변환할 수 없다
# 리스트 데이터만 데이터프레임으로 변환할 수 있다
df = pd.read_json('sample-20250916T010128Z-1-001\sample\sample5.json')
print(df)
print(df.index)
print(df.columns)

  name  age city
0  홍길동   25   서울
1  김철수   30   부산
RangeIndex(start=0, stop=2, step=1)
Index(['name', 'age', 'city'], dtype='object')

In [117]:
# 데이터 꺼내기
# 홍길동의 나이
df.loc[0,'age']
# 김철수의 모든 데이터 꺼내기
df.loc[1, : ]

name    김철수
age      30
city     부산
Name: 1, dtype: object

In [137]:
df = pd.read_json('quiz-20250916T010128Z-1-001\quiz\products.json')
df

   상품명    가격  재고
0   사과  3000  10
1  바나나  2000  20
2   포도  4000  15
3   딸기  5000   8

In [147]:
# 상품명을 인덱스로 설정
df.set_index('상품명')
# 모든 상품명을 출력
df.index
# 가격 3000원 이상만 출력
df['가격'] >= 3000
# bool 배열을 인덱스로 사용
df[df['가격'] >= 3000]

df['가격'].mean()
# 새로운 컬럼 총액(가격*재고)
# 시리즈 * 시리즈 => 인덱스로 연결
# 새로운 열 = 시리즈
df['총합'] = df['가격'] * df['재고']
df

   상품명    가격  재고     총합
0   사과  3000  10  30000
1  바나나  2000  20  40000
2   포도  4000  15  60000
3   딸기  5000   8  40000

In [165]:
df = pd.read_json('quiz/books.json')
df

          제목   저자     가격  대출가능권수
0  데이터 분석 입문  김철수  18000       3
1  파이썬 프로그래밍  이영희  22000       5
2    머신러닝 기초  박민수  25000       2
3    인공지능 시대  최지연  30000       1
4  데이터베이스 개론  홍길동  20000       4

In [167]:
df = df.set_index('제목')
df

            저자     가격  대출가능권수
제목
데이터 분석 입문  김철수  18000       3
파이썬 프로그래밍  이영희  22000       5
머신러닝 기초    박민수  25000       2
인공지능 시대    최지연  30000       1
데이터베이스 개론  홍길동  20000       4

In [168]:
df[df['가격'] >= 20000]

            저자     가격  대출가능권수
제목
파이썬 프로그래밍  이영희  22000       5
머신러닝 기초    박민수  25000       2
인공지능 시대    최지연  30000       1
데이터베이스 개론  홍길동  20000       4

In [169]:
df[df['대출가능권수'] <= 2]

          저자     가격  대출가능권수
제목
머신러닝 기초  박민수  25000       2
인공지능 시대  최지연  30000       1

In [170]:
df.sort_values(['가격'], ascending=False)

            저자     가격  대출가능권수
제목
인공지능 시대    최지연  30000       1
머신러닝 기초    박민수  25000       2
파이썬 프로그래밍  이영희  22000       5
데이터베이스 개론  홍길동  20000       4
데이터 분석 입문  김철수  18000       3

In [171]:
df.sort_values(['대출가능권수'], ascending=False)

            저자     가격  대출가능권수
제목
파이썬 프로그래밍  이영희  22000       5
데이터베이스 개론  홍길동  20000       4
데이터 분석 입문  김철수  18000       3
머신러닝 기초    박민수  25000       2
인공지능 시대    최지연  30000       1

In [173]:
df['가격'].mean()

np.float64(23000.0)

## 5.3 데이터베이스 연결하기
- 설치형 데이터베이스 : mysql, oracle...  
- 파일형 데이터베이스 : sqlite ..
    파일형 데이터베이스는 파일만 있으면 어디서든 열 수 있다

### 데이터베이스 연결 및 테이블 생성

In [174]:
# 모듈 불러오기
import sqlite3

In [175]:
# 데이터 베이스 연결 또는 생성
# connect(데이터베이스 이름)
con = sqlite3.connect('mydata.sqlite')

In [ ]:
# 학생의 정보를 저장할 테이블 생성
# 데이터베이스 명령: sql(쿼리)
# create
# insert select update delete 
# commit rollback
con.execute("CREATE TABLE student (id INTEGER, name TEXT, age INTEGER)")
# 테이블에 데이터 추가
con.execute("INSERT INTO student VALUES (1, '둘리', 25)")
con.execute("INSERT INTO student VALUES (2, '도우너', 30)")
con.commit()

### 테이블에 있는 데이터 조회

In [180]:
cur = con.execute('SELECT * FROM student')
# 쿼리 결과 꺼내기
rows = cur.fetchall()
rows

[(1, '둘리', 25), (2, '도우너', 30)]

### 단건 데이터 조회

In [182]:
cur = con.execute('SELECT * FROM student WHERE id = 1')
# 쿼리 결과 확인
row = cur.fetchone()
row

(1, '둘리', 25)

## 5.3 공공데이터 활용하기

### 인천지역의 9/14 날씨 데이터 가져오기

In [198]:
# CSV 파일 읽기
df = pd.read_csv('sample-20250916T010128Z-1-001/sample/OBS_ASOS_TIM_20250916161140.csv',
           encoding='euc-kr')
# 행열 이름은 자동으로 설정
# 행은 정수, 열은 csv의 첫번째 행
print(df)
print(df.index)
print(df.columns)

     지점 지점명                일시    기온  습도
0   112  인천   2025-09-14 1:00  22.2  84
1   112  인천   2025-09-14 2:00  21.8  86
2   112  인천   2025-09-14 3:00  21.7  87
3   112  인천   2025-09-14 4:00  21.4  87
4   112  인천   2025-09-14 5:00  21.2  87
5   112  인천   2025-09-14 6:00  21.2  87
6   112  인천   2025-09-14 7:00  21.3  87
7   112  인천   2025-09-14 8:00  22.3  86
8   112  인천   2025-09-14 9:00  22.9  85
9   112  인천  2025-09-14 10:00  23.8  82
10  112  인천  2025-09-14 11:00  24.6  79
11  112  인천  2025-09-14 12:00  25.9  71
12  112  인천  2025-09-14 13:00  26.9  64
13  112  인천  2025-09-14 14:00  27.4  61
14  112  인천  2025-09-14 15:00  27.7  65
15  112  인천  2025-09-14 16:00  27.4  70
16  112  인천  2025-09-14 17:00  27.0  68
17  112  인천  2025-09-14 18:00  26.4  70
18  112  인천  2025-09-14 19:00  25.2  73
19  112  인천  2025-09-14 20:00  24.7  78
20  112  인천  2025-09-14 21:00  24.5  82
21  112  인천  2025-09-14 22:00  24.2  85
22  112  인천  2025-09-14 23:00  23.9  84
23  112  인천   2025-09-15 0:00  23.7  84
RangeIndex(start=0, stop=24, step=1)
Index(['지점', '지점명', '일시', '기온', '습도'], dtype='object')

#### 하루 평균 기온과 습도 구하기

In [197]:
# 기온
int(df['기온'].mean())
int(df['습도'].mean())

78

#### 하루 중에 제일 더운 시간은?

In [201]:
# idxmax : 가장 큰 값이 포함되어 있는 행의 위치
i = df['기온'].idxmax()
# id 설정 안되어 있기 때문에 행의 이름과 위치가 같음
df.loc[i]
df.loc[i, '일시']

'2025-09-14 15:00'

In [227]:
df = pd.read_csv('sample-20250916T010128Z-1-001\sample\인천광역시_정류장별 이용승객 현황_20250731.csv',
                 encoding='euc-kr')
df

,정류소명,정류소아이디,총승차건수,총하차건수,승차건수(카드),하차건수(카드),승차건수(현금),일평균승하차건수
0,(구)주안2동치안센터,37302,7704,4576,7704,4576,0,396
1,(주)경동세라믹스,89146,868,10,868,10,0,28
2,(주)경인양행앞,42096,1670,1030,1670,1030,0,87
3,(주)경인양행앞,42097,2131,5063,2131,5063,0,232
4,(주)대한특수금속,39050,1218,150,1218,150,0,44
...,...,...,...,...,...,...,...,...
6666,힐스테이트학익104동앞,37670,10904,5985,10904,5985,0,544
6667,힐캐슬프라자,39329,13176,19090,13176,19090,0,1040
6668,힐캐슬프라자,39331,20701,10906,20701,10906,0,1019
6669,힘찬병원,40891,5907,8183,5907,8183,0,454
6670,힘찬병원,40892,4912,3424,4912,3424,0,268

In [237]:
df['총승차건수'] >= 100000
# bool 시리즈를 인덱스로 사용
df[df['총승차건수'] >= 100000]

,정류소명,정류소아이디,총승차건수,총하차건수,승차건수(카드),하차건수(카드),승차건수(현금),일평균승하차건수
1798,동암남부역,40797,126437,108459,126437,108459,0,7577
1829,동인천역,35185,101169,46791,101169,46791,0,4772
1938,롯데백화점(인천터미널),37513,171449,155415,171449,155415,0,10544
1939,롯데백화점(인천터미널),39588,158171,116540,158171,116540,0,8861
3392,송내역남부,56002,140367,119838,140367,119838,0,8393
3671,시민공원역.포레나미추홀,37326,105656,20031,105656,20031,0,4054
5132,인하대역(7번출구),37091,106013,79294,106013,79294,0,5977
5501,주안역환승정류장,37617,112937,89282,112937,89282,0,6523

In [229]:
df[df['총하차건수'] == 0]

         정류소명  정류소아이디  총승차건수  총하차건수  승차건수(카드)  하차건수(카드)  승차건수(현금)  일평균승하차건수
127    가나안마을앞   43905      9      0         9         0         0         0
323    강화산단입구   90097     11      0        11         0         0         0
512      경동택배   89315     71      0        71         0         0         2
550       경전말   43934     17      0        17         0         0         0
653    고비고개정상   43569      3      0         3         0         0         0
...       ...     ...    ...    ...       ...       ...       ...       ...
6196  한국콘베어공업   92049     21      0        21         0         0         0
6379      허튼개   90120     13      0        13         0         0         0
6453  현대철강레이져   90221     17      0        16         0         1         0
6520    화개사입구   90035    119      0       118         0         1         3
6611     효자교앞   90199      8      0         8         0         0         0

[136 rows x 8 columns]

In [238]:
# 승차건수(현금)이 100건 이상인 정류장
df[df['승차건수(현금)'] >= 100]

      정류소명  정류소아이디  총승차건수  총하차건수  승차건수(카드)  하차건수(카드)  승차건수(현금)  일평균승하차건수
346  강화터미널   43096  60873  42403     60439     42403       434      3331

In [240]:
# 승차건수(현금)이 승차건수(카드)보다 많은 정류장
df[df['승차건수(현금)'] > df['승차건수(카드)']]
# 시리즈 >= 시리즈 :

         정류소명  정류소아이디  총승차건수  총하차건수  승차건수(카드)  하차건수(카드)  승차건수(현금)  일평균승하차건수
917   국화리야영장앞   43843      1     52         0        52         1         1
2942   상용진료소앞   90004      2     69         0        69         2         2
5149    인화성입구   90063      2     24         0        24         2         0